export const segmentsData = [
  {
    startYear: 1900,
    endYear: 1918,
    label: 'Начало XX века',
    events: [
      { year: 1903, text: 'Братья Райт совершают первый управляемый полёт на самолёте.' },
      { year: 1912, text: 'Крушение "Титаника" — крупнейшая морская катастрофа своего времени.' },
      { year: 1914, text: 'Начало Первой мировой войны.' },
      { year: 1917, text: 'Октябрьская революция в России.' },
      { year: 1918, text: 'Окончание Первой мировой войны, подписание Компьенского перемирия.' },
    ],
  },
  {
    startYear: 1939,
    endYear: 1945,
    label: 'Вторая мировая война',
    events: [
      { year: 1939, text: 'Нацистская Германия нападает на Польшу. Начало Второй мировой войны.' },
      { year: 1941, text: 'Нападение Японии на Перл-Харбор, США вступают в войну.' },
      { year: 1943, text: 'Сталинградская битва — поворотный момент войны.' },
      { year: 1944, text: 'Высадка союзников в Нормандии (D-Day).' },
      { year: 1945, text: 'Сброшены атомные бомбы на Хиросиму и Нагасаки. Капитуляция Японии.' },
    ],
  },
  {
    startYear: 1957,
    endYear: 1969,
    label: 'Космическая гонка',
    events: [
      { year: 1957, text: 'СССР запускает спутник "Спутник-1" — начало космической эры.' },
      { year: 1961, text: 'Юрий Гагарин становится первым человеком в космосе.' },
      { year: 1963, text: 'Валентина Терешкова — первая женщина-космонавт.' },
      { year: 1969, text: 'Нил Армстронг совершает первый шаг на Луне.' },
    ],
  },
  {
    startYear: 1989,
    endYear: 1991,
    label: 'Конец Холодной войны',
    events: [
      { year: 1989, text: 'Падение Берлинской стены.' },
      { year: 1990, text: 'Объединение Германии.' },
      { year: 1991, text: 'Распад СССР. Завершение Холодной войны.' },
    ],
  },
  {
    startYear: 2001,
    endYear: 2011,
    label: 'Глобальные вызовы',
    events: [
      { year: 2001, text: 'Теракты 11 сентября в США. Начало глобальной "войны с терроризмом".' },
      {
        year: 2004,
        text: 'Цунами в Индийском океане — одна из самых смертоносных природных катастроф.',
      },
      { year: 2008, text: 'Мировой финансовый кризис.' },
      { year: 2011, text: 'Арабо-весна. Начало гражданской войны в Сирии.' },
    ],
  },
  {
    startYear: 2020,
    endYear: 2024,
    label: 'Новейшее время',
    events: [
      { year: 2020, text: 'Пандемия COVID-19 охватывает мир.' },
      { year: 2021, text: 'Массовая вакцинация от COVID-19, запуск мессенджеров Starlink.' },
      {
        year: 2022,
        text: 'Запущен космический телескоп James Webb — крупнейший в истории человечества.',
      },
      { year: 2023, text: 'Взлёт популярности генеративного ИИ: ChatGPT, Midjourney и др.' },
      { year: 2024, text: 'Подготовка к миссиям NASA "Artemis" на Луну.' },
    ],
  },
];
